Examples/ConservativeDBSPaper/DBS/Bentheimer_400cube/0_orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];  // Kinematic pressure (m²/s²)

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;   
        value           uniform 1;   
    }

    outlet
    {
        type            fixedValue; 
        value           uniform 0;
    }

    walls
    {
        type            zeroGradient;
    }

    solidwalls
    {
        type            zeroGradient; 
    } 

    frontAndBack
    {
        type             zeroGradient; 

    }

}

// ************************************************************************* //
