Examples/ConservativeDBSPaper/DBS/Bentheimer_400cube/Allrun.sh
./createMesh.sh > createMesh.out
./initCaseFlow.sh > initCaseFlow.out
./runCaseFlow.sh > runCaseFlow.out
./processFlow.sh > processFlow.out
