Examples/ConservativeDBSPaper/DBS/Bentheimer_400cube/system/postProcessDict1
FoamFile
{
version     4.0;
format      ascii;
class       dictionary;
location    "system";
object      postProcessDict;
}

direction flowdir;

x1 x_1;
x2 x_2;

y1 y_1;
y2 y_2;

z1 z_1;
z2 z_2;

inletName inlet;

outletName outlet;

velocity volumeAveraged;
pressureDrop direct;


////velocity: volumeAveraged or inlet
////pressure: direct or velocityWeightedAverageGradient or velocityWeightedAverageViscousForce or momentumSource
