Examples/ConservativeDBSPaper/DBS/Bentheimer_400cube/system/topoSetDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

actions
(
{
name refinementRegion;
type cellSet;
action new;
source fieldToCell;
field eps;
min 0.001;
max 0.999;
}
);